Revit 2027 API
EnergyDataSettings.CreateAnalyticalModel Property
Note: This API is now obsolete.
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public bool CreateAnalyticalModel { get; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public ReadOnly Property CreateAnalyticalModel As Boolean
	Get
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property bool CreateAnalyticalModel {
	bool get ();
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member CreateAnalyticalModel : bool with get
Property Value
Boolean
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace